# Задача 30:  
# Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

        # Input:        1
        #               2
        #               5
        # Output:       1, 3, 5, 7, 9


a1 = int(input())
d = int(input())
n = int(input())
list=[]

for i in range(1, n+1):
    an = a1 + (i - 1) * d
    list.append(an)
print(*list)